Repository: magi1125/inclusive-design-pattern
Catalog: tm/chapter-11_EN-US_JA.tmx
Source language: en_us
Languages: ja

source: A Paragraph
ja: パラグラフ

source: Let’s start small.
ja: まずは小さなところから。

source: In Brad Frost’s atomic design terminology1, a paragraph would be an atom: an indivisible building block with which complex patterns (molecules, organisms and pages) are created.
ja: ブラッド・フロスト（Brad Frost）のアトミックデザイン？？（脚注15）？？では、パラグラフ（段落）は原子にあたります。【コメント：原文pdfでは前章の最後の脚注も15となっています。以降も原文通りの番号にしてあります。】複雑なパターン（分子、有機体、ページ）を作成するための、これ以上分割できない基本単位です。

source: Some say [a picture paints a thousand words], but I prefer the contrary expression: "“Never send a picture to do the job of words.” Text is the most direct and efficient way of communicating information and — though imagery and other media have supplemental value for those who learn better visually or have literacy issues — it should be treated as primary.
ja: 一枚の絵は千の言葉に値すると言う人もいますが、私はその反対の「絵に言葉の仕事をさせてはならない」という表現の方が好きです。テキストは、情報を伝えるのに最も直接的で効果的な方法であり、第一の手段として扱うべきです（ただし、視覚からの方が情報を受け取りやすい人や読み書きに困難を抱えている人には、画像やその他の媒体には補足的な価値があります）。

source: This applies whether you’re in the business of publishing lengthy, florid prose or dotting isolated descriptions and messages around an application.
ja: これは、長々とした美辞麗句の多い散文を公開する場合でも、使い方に関する個々の説明やメッセージを点々と記述する場合でも当てはまります。

source: With so many exciting opportunities available to us to build interactive mechanisms, it’s tempting to neglect the design of our body text.
ja: インタラクティブな仕組みを構築するという楽しい機会がたくさんあるため、つい本文のデザインをなおざりにしたくなります。

source: Yet not only is a readable web page an inclusive one, there’s also some interactivity to address in the forms of zoom functionality and inline hyperlinks.
ja: しかし、読むことができるWebページだけがインクルーシブなわけではなく、ズーム機能やインラインハイパーリンクといった形で対処すべきインタラクティブ性も存在します。

source: The Typeface
ja: 書体

source: There is a lot of conflicting advice on what the characteristics of a readable body text typeface should be.
ja: 読みやすい本文テキストの書体の特徴については、相反する意見が多数あります。

source: One well-supported claim is that sans serif fonts are more readable than serif ones.
ja: 十分に裏付けがある意見の1つに、セリフフォントよりサンセリフフォントの方が読みやすいというものがあります。

source: Nonetheless, it is entirely possible to design an excruciatingly unreadable font which is technically sans serif.
ja: しかし、技術的にはサンセリフであっても、耐えがたいほど読みにくいフォントをデザインすることも十分可能です。

source: Instead of relying on conventional wisdom, here are a few things to ask about a typeface under consideration:
ja: 従来からの知恵に頼るのではなく、検討中の書体については、以下について考える必要があります。

source: •Does it have any ornamentation that gets in the way of comprehension?
ja: • 理解の邪魔になる装飾がないか？

source: •Are the metrics (such as x-height2) consistent between letterforms?
ja: • 各種の文字のメトリクス（x-heightなど）（脚注16）が一致しているか？

source: •Are individual letterforms distinct in shape or can they be confused with others?
ja: • 個々の文字は形がはっきり識別できるか？他の文字と紛らわしくないか？

source: •Does the typeface support all of the characters and font styles that are needed?
ja: • その書体は、必要とされるすべての文字とフォントスタイルをサポートしているか？

source: The British Dyslexia Association notes some specific characteristics3 that can aid legibility.
ja: 英国ディスレクシア協会（British Dyslexia Association）は、読みやすさを向上できるいくつかの特徴に言及しています。（脚注17）

source: Generous ascenders (e.g. the vertical line in d) and descenders (e.g. the down-pointing line in y) proved popular among dyslexic readers in their research.
ja: 彼らの研究では、アセンダ（dの縦線など）とディセンダ（yの下向きの線など）が大きい方が、ディスレクシア（難読症）の人たちに好評であることが分かりました。

source: A d and b which were not an exact mirror image of one another also helped, as well as a clear distinction between an uppercase I, lowercase l and 1.
ja: また、dとbが完璧な鏡文字ではないこと、大文字のI、小文字のl、1がはっきりと区別されていることにも効果がありました。

source: Kerning (the spacing between characters) benefited from being reasonably generous, particularly between r and n.
ja: カーニング（文字間のスペース）は、特にrとnの間では適度な間隔を空けた方が読みやすくなり、

source: Otherwise “modern” could be read as “modem.”
ja: 間隔が狭すぎると「modern」は「modem」と読めてしまいます。

source: Although sans serif fonts are generally thought to be more readable, their simplicity makes them more vulnerable to having similar letterforms.
ja: サンセリフフォントは一般に読みやすいと考えられていますが、簡素であるため、似た字形になりやすいという特徴があります。

source: As with all things, successful comprehension is a question of offering enough but not too much information.
ja: これらを考慮すると、理解できるテキストを作成できるかどうかは、過多ではない必要十分な情報を提供できるかどうかにかかっています。

source: Accordingly, serif typefaces are generally regarded as overcomplex, but a purposeful use of serifs to differentiate characters is actually beneficial.
ja: したがって、セリフフォントは一般に複雑すぎるとみなされていますが、実際のところ、文字を区別するために意図的にセリフを使用するのは有効です。

source: It’s important to note that legible body text for folks with reading disorders such as dyslexia is also pleasant body text for those who have less trouble reading.
ja: ディスレクシアなどの読字障害を持つ人にとって読みやすいテキストは、読むのに問題がない人にとっても好ましいテキストであるということに留意してください。

source: By choosing a typeface that we feel the average user could read, we’d be consciously alienating a section of our users.
ja: 平均的なユーザーが読めるだろうと思う書体を選ぶということは、ユーザーの一部を意識的に疎外していることになります。

source: Instead, by selecting a typeface which is workable for those who struggle to read, we arrive at a choice that works for everyone.
ja: そうではなく、読むことに困難を抱える人にも読みやすい書体を選択することで、すべての人に機能する選択肢に到達します。

source: This is efficient and effective inclusive design.
ja: これが効果的で効率的なインクルーシブデザインです。

source: “The average user is created from the combination of all users.
ja: 「平均的なユーザーは、すべてのユーザーを組み合わせて作られます。

source: What we get is, in fact, a completely different user.
ja: 実際に得られるのは、まったく異なるユーザーです。

source: None of our users is like the average user.
ja: ユーザーの誰もが平均的ユーザーとは異なります。

source: Therefore, when designing for that artificial individual we create something that doesn’t fit anyone’s needs.” – “Designing for the extremes4,” Susana Gonzalez Ruiz
ja: この作り出された個人に合わせてデザインするということは、誰のニーズにも合わないものを作っているということです」 —「Designing for the extremes」、スサーナ・ゴンザレス・ルイス（Susana Gonzalez Ruiz）

source: As the excellent article “Designing for the extremes5” points out, designing first for users in extreme situations helps us better serve everyone.
ja: 「Designing for the extremes」（脚注18）という素晴らしい記事で指摘されているように、極端な状況に置かれたユーザーを優先してデザインすることで、すべての人により良いサービスを提供できます。

source: The article uses bandwidth as another exemplar: a web app that’s performant on the most unreliable mobile network is, therefore, performant everywhere.
ja: この記事では、もう1つの例として帯域幅を取り上げ、最も信頼性が低いモバイルネットワーク上で高い性能を発揮できるWebアプリケーションは、どこでも高い性能を発揮できるとしています。

source: The first shows that people on poor networks are a subgroup of people who benefit from performant websites.
ja: 高性能Webサイトのメリットを享受する人：非常に低質なネットワーク上の人

source: The second shows that people with visual dyslexia are a subgroup of people who benefit from readable fonts.
ja: 読みやすいフォントのメリットを享受する人：ディスレクシアの人

source: However, it’s important not to think about extreme cases in isolation and to target specific groups.
ja: しかし、極端なケースを分離して考えないこと、そして特定のグループをターゲットにしないことが重要です。

source: In an experimental study carried out in Spain6 (PDF) which investigated the readability of different fonts to dyslexic people, a typeface designed specifically for dyslexic readers performed very poorly.
ja: スペインで実施された、ディスレクシアの人々に対する各種フォントの読みやすさを調査した実験的研究（脚注19）（PDF）では、ディスレクシアの読者専用にデザインされた書体の成績が非常に悪いという結果になりました。

source: It would appear that the typeface designers, though well-meaning, made some generalizations about the target audience.
ja: 書体デザイナーが、良かれと思ってターゲットの読者についてある種の一般化を行ったと考えられます。

source: As a result, they alienated the majority of dyslexic readers as well as creating a “clunky and difficult to read” font for everyone.
ja: この結果、彼らはディスレクシアの読者の大部分を疎外しただけではなく、誰にとっても「不格好で読みにくい」フォントを作ってしまったのです。

source: In the article “A Typeface For Dyslexics?
ja: Lucida書体の作成者であるチャック・ビゲロウ（Chuck Bigelow）は、ブログ記事「ATypefaceForDyslexics?

source: Don’t Buy Into The Hype7,” the creator of the Lucida typeface, Chuck Bigelow, corroborates these findings with his own research.
ja: Don’t Buy Into The Hype」（脚注20）で、自身の研究により、この発見を確証しています。

source: Typesetting
ja: タイプセッティング

source: Having chosen an inclusive typeface, we ought to do it justice with good composition.
ja: インクルーシブな書体を選択したら、優れた文字組みでその良さを発揮させる必要があります。

source: Inclusive typesetting aids readability and is the task of choosing a measure, justification and leading which suit the typeface at hand.
ja: インクルーシブなタイプセッティングは、読みやすさを向上します。これは、使用している書体に合った？？カラム幅、行端揃え、行送り？？を選択する作業です。【コメント：訳語に問題ないかご確認ください。多数あります。「measure＝カラム幅」「justification＝行端揃え」「leading＝行送り」】

source: These provisions, according to Bigelow and others, are likely more important than the choice of font (unless the font is eye-wateringly illegible, of course).
ja: ビゲロウなどによると、これらの対策はフォントの選択よりもさらに大切であるようです（もちろん涙が出るほど読みにくいフォントでなければの話です）。

source: Measure
ja: カラム幅

source: A paragraph’s measure is the length, in characters, of one line.
ja: パラグラフのカラム幅は1行の長さ（文字数）です。

source: In text that isn’t justified (see “Justification” below) this will vary, so you should measure the longest line of a sample paragraph.
ja: 行端揃えされていないテキスト（下の「行端揃え」を参照）では、これはバラバラになります。このため、サンプルパラグラフの最も長い行の幅を決定します。

source: Lines that are too long are difficult to read because, on reaching the end of the line, scanning back to find the start of the following line becomes problematic.
ja: 行が長すぎると、行末まで読んだ後、次行の行頭を探すのが大変になるため読みにくくなります。

source: Lines that are too short require darting your eyes back and forth too frequently — something that becomes tiresome quickly.
ja: また、行が短すぎると、視線を頻繁に素早く往復させなくてはならなくなり、読む人はすぐに疲れてしまいます。

source: In Robert Bringhurst’s book The Elements of Typographic Style, he recommends a measure between 45 and 75 characters.
ja: ロバート・ブリングハースト（Robert Bringhurst）は著書『The Elements of Typographic Style』の中で、カラム幅を45～75文字にすることを推奨しています。

source: In CSS, 1rem roughly corresponds to the width of the typeface’s lowercase m, so a paragraph which is 60rem wide could be said to have a measure of 60 — nicely within range for comfort.
ja: CSSでは、1remが書体の小文字mの幅にほぼ該当します。このため、幅が60remのパラグラフはカラム幅が60であると言うことができ、ちょうど読みやすい幅に収まります。

source: Setting paragraphs’ measure directly is unwise, since in responsive and modular layouts they should wrap according to their containing element.
ja: パラグラフのカラム幅を直接設定するのは賢い方法ではありません。レスポンシブなモジュール式のレイアウトでは、含まれる要素に応じて改行されるためです。

source: Bearing this in mind, no container of text in your layout should exceed your stated measure.
ja: これを念頭に置いて、レイアウト内のテキストのコンテナは、指定したカラム幅よりも小さくすべきです。

source: For instance, your <main> element should be set with an appropriate max-width.
ja: たとえば、<main>要素は、適切なmax-widthで設定します。

source: This has a useful outcome regarding media queries which augment the root font size: the measure adjusts proportionately.
ja: これは、ルートのフォントサイズを大きくするメディアクエリに関して役立つ結果となります。カラム幅が比例的に調整されるためです。

source: For example, where I increase the font size for wider desktop screens, the measure — which is defined using a unit relative to the font size (rem) — also increases.
ja: たとえば、より幅が広いデスクトップ画面でフォントサイズを大きくする場合、カラム幅（フォントサイズに相対的な単位（rem）を使用して定義される）も大きくなります。

source: html { font-size: 100%; } main { max-width: 60rem; } @media (min-width: 120rem) { html { font-size: 150%; } }
ja: html { font-size:100%;/* デフォルトなので、このブロックは削除可能です*/ } main { max-width: 60rem; } @media (min-width: 120rem) { html { font-size: 150%; } }

source: By virtue of relativity, we don’t just set an inclusive measure but ensure it within responsive layouts too.
ja: 相対的に調整されるおかげで、インクルーシブなカラム幅をセットするだけでなく、レスポンシブなレイアウト内に確実に収めることができます。

source: Justification
ja: 行端揃え

source: Justification, possible by setting text-align: justify; in your CSS, is generally considered bad practice for web content.
ja: CSSでtext-align:justify;を設定することで行える行端揃えは、一般にWebコンテンツには推奨されない慣習です。

source: Justification means making each line the same length, which makes paragraphs look neater but can severely impair readability.
ja: 行端揃えとは、各行を同じ長さにすることを意味します。これによりパラグラフの見た目はすっきりしますが、読みやすさは大きく損なわれる可能性があります。

source: If you’ll excuse the pun, I’ve struggled to justify using justified text on many occasions because I just like the way it looks.
ja: 駄じゃれのようで申し訳ありませんが、私は行端揃え（justification）の見た目が好きで、これを何度も正当化（justify）しようと試みてきました。

source: I’d be the first to admit I was putting vanity before inclusion.
ja: 私自身が、インクルーシブより見た目の美しさを優先しようとしていたのです。

source: Bad dog!
ja: 悪い見本ですね！

source: In text justification, to make each line of equal length, words need to be redistributed within their lines, creating distractingly uneven word spacing.
ja: テキストの行端揃えでは、各行を同じ長さにするために、その行内で単語が再割り付けされるので、単語間のスペースが不均一になって読みにくくなります。

source: Three columns of justified text with two instances of large word spaces highlighted.
ja: この2箇所は単語間のスペースが特に大きい

source: Justified text produces the worst results when using a narrow measure, such as in the column-based layout illustrated.
ja: 行端揃えされたテキストは、この図に示すカラムベースのレイアウトのように、カラム幅が狭いときに最悪な結果になります。

source: In desktop publishing, this issue is mitigated by hyphenation: breaking up larger words to redistribute them more evenly.
ja: デスクトップパブリッシングでは、ハイフンで長い単語を分割し、より均等に再割り付けすることにより、この問題を軽減することができます。

source: Unfortunately, CSS hyphenation, available via the hyphens8 property, is poorly implemented across browsers.
ja: 残念ながら、hyphens（脚注21）で提供されるCSSのハイフンは、あらゆるブラウザで正しく実装されているわけではありません。

source: One of the most popular browsers, Chrome, does not support hyphenation at all.
ja: 最も普及しているブラウザの1つであるChromeは、ハイフンをまったくサポートしていません。

source: To make matters worse, JavaScript polyfills9 for hyphenation tend to be extremely weighty because they must refer to a large library of agreed hyphenation patterns.
ja: さらに悪いことに、ハイフンを使用するためのJavaScriptポリフィル（脚注22）は、決まったハイフネーションパターンの大きなライブラリを参照する必要があるため、極度に重くなりがちです。

source: Not all browsers even support hyphenation for languages other than English.
ja: ブラウザの中には、英語以外の言語でのハイフンをサポートしていないものもあります。

source: For good readability without JavaScript dependencies and their attendant performance issues, the default text-align value of left is preferable.
ja: JavaScriptに依存したり、それに付随するパフォーマンスの問題に頭を悩ますことなく、読みやすくするためには、デフォルトのtext-align値のleftの使用が推奨されます。

source: This results in a ragged right-hand side to your paragraphs, but users won’t care.
ja: この結果、パラグラフの右側は不揃いになりますが、ユーザーには気にならないでしょう。

source: They’ll be too busy effortlessly digesting your content.
ja: 彼らはコンテンツから情報を得るのに忙しいはずですから。

source: Leading (line-height)
ja: 行送り（LINE-HEIGHT）

source: Leading relates to the height of individual lines.
ja: 行送りは、各行の高さに関連しています。

source: It is the vertical measure between one line’s baseline and the next.
ja: 1つの行のベースラインと次の行のベースラインの間の距離です。

source: In the W3C’s WCAG 2.0 accessibility guideline 1.4.8 Visual Presentation10, it is recommended that a generous “space-and-a-half” of leading is applied to paragraphs.
ja: W3CのWCAG 2.0アクセシビリティガイドライン1.4.8「視覚的提示」（脚注23）では、パラグラフに「1行の高さの1.5倍」の行送りを適用することを推奨しています。

source: In CSS this can be expressed using the line-height property.
ja: CSSでは、これはline-heightプロパティを使用して表すことができます。

source: For instance, if the font size was 16px, the leading should be at least 24px.
ja: たとえば、フォントサイズが16pxの場合、行送りを24px以上にします。

source: However, as stated earlier in “The Document,” it’s rarely advisable to use fixed units like pixels because it makes managing comfortable proportions a headache.
ja: しかし、先ほど「＄＄The Document＄＄」で説明した通り、通常は、ピクセルなどの固定の単位の使用は推奨されません。読みやすい比率を維持するのが難しくなるからです。

source: Instead, line-height should be set as a unitless proportion:
ja: 代わりに、単位のない比率としてline-heightを設定しましょう。

source: /* (life is too short) p { font-size: 16px; line-height: 24px; } */ p { font-size: 1rem; line-height: 1.5; }
ja: /* (人生はとても短い) p { font-size: 16px; line-height: 24px; } */ p { font-size:1rem;/* デフォルトなので、この行は不要です*/ line-height:1.5; }

source: Now, as the paragraph font size is increased or decreased (either in a media query or by the user changing their font size settings), a comfortable, proportionate line height is ensured.
ja: これで、パラグラフのフォントサイズが大きくなったり小さくなったりしても（メディアクエリによる変更、またはユーザーがフォントサイズ設定を変更した場合など）、読みやすいバランスのとれた行の高さになります。

source: When a pixel-based line height is used, the following is the result: Two paragraphs.
ja: ピクセルベースの行の高さが使用されている場合、結果は以下のようになります。

source: The left one has a comfortable line height.
ja: 標準フォントサイズ

source: The right one has the same line height but with larger letterforms, forcing each line to overlap.
ja: ユーザーが大きくしたフォントサイズ

source: The danger of a line height that is not relative to the font size.
ja: フォントサイズと比例しない行の高さは危険です。

source: Contrast
ja: コントラスト

source: Why so many type designers are enamored with pale gray text on a white background, I’ll never know.
ja: なぜこれほど多くの書体デザイナーが、白の背景上に薄いグレーのテキストを好んで使うのか、私には分かりません。

source: Quite apart from it causing readability issues, it just looks feeble.
ja: 読みやすさに問題が生じることはさておき、弱々しく見えます。

source: In any case, low-contrast combinations of text and background colors should be avoided.
ja: どちらにしても、テキストと背景の色のコントラストを低くするのは避けるべきです。

source: Since it’s easy to become wedded to brand colors early in a project, instead of testing color contrast after the fact, I recommend designing an accessible color scheme from the outset.
ja: プロジェクトの初期段階ではブランドカラーに縛られやすいため、作成後に色のコントラストをテストするのではなく、最初から使えるカラースキームをデザインすることをお勧めします。

source: Free tools like Contrast-A11 (requires Flash) and Color Safe12 are available to help you there.
ja: これには、フリーツールのContrast-A（脚注24）（Flashが必要）やColor Safe（脚注25）などが役立ちます。

source: If you end up in the unfortunate position that colors were chosen without recourse to contrast accessibility, tools like Color Contrast Analyser13 can help you identify problem areas.
ja: コントラストのアクセシビリティを考慮せずに色が選択されてしまった場合は、Color Contrast Analyser（脚注26）などのツールを使えば問題のある領域を特定するのに役立つでしょう。

source: I’m glad it’s not me who’ll have to inform your brand guru!
ja: ？？ブランディングのリーダーに伝えるのが私の役割でなくてよかった！？？【コメント：不安訳です。原文「I’m glad it’s not me who’ll have to inform your brand guru!」】

source: What’s less known is that very high contrast can actually diminish readability for some users.
ja: あまり知られていませんが、コントラストが非常に高い場合も、一部のユーザーにとって読みにくくなります。

source: Sufferers of scotopic sensitivity syndrome14 (or Irlen syndrome) are sensitive to glare, and stark contrast can result in blurred text or text that appears to move around.
ja: アーレン症候群（脚注27）の人はまぶしさに敏感で、コントラストが強いとテキストがぼやけたり、動き回っているように見えることがあります。

source: It is advisable to slightly temper the contrast between your paragraph text and background color.
ja: パラグラフのテキストと背景の色のコントラストは、少し控えめにすることをお勧めします。

source: As I’ll restate throughout the book, there’s rarely an inclusive design provision that benefits only one kind of user or reader.
ja: これから本書の中で繰り返し述べますが、1つの種類のユーザーまたは読者だけにメリットがあるインクルーシブデザイン対策はまずありません。

source: At this juncture I’d like to thank you in advance for dampening contrast in this way.
ja: 皆さんにはこの機会に、「コントラストを弱めてくれてありがとう」と前もって言っておきますね。

source: That’s because bright light has a habit of triggering migraines for me.
ja: 私は明るい光を見ると片頭痛になるのです。

source: Thank you.
ja: ご協力に感謝します。

source: Inline Links
ja: インラインリンク

source: CSS is a blessing and a curse.
ja: CSSはありがたくもあり、厄介でもあります。

source: It gives us the freedom to exercise our creativity, and it gives us the freedom to exercise our creativity.
ja: 創造力を働かせる自由をくれると同時に、創造力を働かせなくてはならない自由をくれるのです。

source: I’m not saying every website and app should look the same, but we have a habit of breaking with conventions just to appear radical.
ja: あらゆるWebサイトとアプリの見た目が同じでなくてはならないとは言いませんが、ただ急進的な見た目にするために、慣習を壊そうとする癖が私たちにはあります。

source: Here’s the thing: in a world of artifice and ornamentation, utility is radical.
ja: 技巧と装飾の世界では、急進性は実用的です。

source: And utility depends on cognition, which depends on convention.
ja: そして実用性は認知に依存しており、認知は慣習に依存します。

source: The trick is to embrace convention without dispensing with personality.
ja: 秘訣は、個性を失わずに、慣習を取り入れることです。

source: Save for button-like call-to-action links which play by different rules of affordance, it is conventional for links to be underlined.
ja: 異なるアフォーダンスのルールで動作する、ボタンのようなコールトゥアクションリンクを除き、リンクにはアンダーラインを付加するのが慣習です。

source: Not only does capitalizing on this convention help folks to identify links within paragraph text, but it also alleviates a more extreme concern of inclusive design: color blindness.
ja: この慣習を取り入れることで、パラグラフテキスト内のリンクが見分けやすくなるだけでなく、インクルーシブデザインで重視すべき色覚異常の問題も軽減されます。

source: By differentiating inline links by color alone, some readers will not be able to pick them out from the surrounding text, so there should be another means.
ja: 色だけでインラインリンクを区別したのでは、一部の読者は周囲のテキストからリンクを見分けることができないので、別の手段が必要になるのです。

source: For this reason, all browsers render text with text-decoration: underline by default, making inline link design a classic case of doing nothing being a perfectly good resolution.
ja: すべてのブラウザは、デフォルトでtext-decoration: underlineを使用してテキストを表示し、インラインリンクのデザインは「何もしないのが完璧な決断である」ことを示す典型的な例になります。

source: But it’s possible to improve on text-decoration: underline.
ja: しかし、text-decoration: underlineはさらに良くすることができます。

source: With custom CSS, we can keep the symbolic role of an underline but implement it better.
ja: カスタムのCSSを使用すれば、アンダーラインの象徴的な役割はそのままに、より優れた方法で実装できます。

source: Improved Link Underlines
ja: リンクのアンダーラインの向上

source: Since an underline tends to sit directly below the typeface’s baseline, it cuts through the descenders of letterforms like g and j, diminishing the readability of linked text.
ja: アンダーラインは書体のベースラインの直下に付加されことが多いため、gやjなどの文字のディセンダの上をアンダーラインが横切り、リンクテキストが読みにくくなることがあります。

source: Ideally, the underline should not intersect the form of descenders but leave space for them.
ja: できればアンダーラインはディセンダと交差せず、間隔が空いているのが理想です。

source: A solution partly developed at Medium15 does just this, using a CSS background gradient and text shadow.
ja: Medium（脚注28）が部分的に開発した解決策は、CSSの背景グラデーションとテキストシャドウを使用して、まさにそれを実現しています。

source: Here is my adapted version:
ja: 以下は私が手を加えたバージョンです。

source: When using custom, gradient-based underlines you have the luxury of being able to control their color independently of the font color.
ja: カスタムのグラデーションベースのアンダーラインを使用すると、フォントの色とは別にアンダーラインの色を制御することもできます。

source: In this implementation, a linear-gradient background with a height of just 0.05em forms the underline.
ja: この実装では、高さがわずか0.05emのlinear-gradient背景がアンダーラインを形成しています。

source: Descenders are not crossed thanks to a text shadow which protects the letterforms like a moat protects a castle.
ja: テキストシャドウのおかげでアンダーラインはディセンダの上を通らず、まるで堀が城を護っているかのように文字が保護されています。

source: Note that unlike text-decoration: underline;, this underline is adjustable.
ja: text-decoration: underline;とは異なり、このアンダーラインは調整可能です。

source: You can tweak the vertical positioning using background-position, and the thickness using background-size to find the most readable solution for the typeface.
ja: background-positionで垂直位置を調整したり、background-sizeで太さを調整したりして、書体が最も読みやすくなる方法を見つけることができます。

source: Be wary, though, of older browsers that do not support gradient backgrounds.
ja: ただし、グラデーション背景をサポートしていない古いブラウザには注意してください。

source: These should have a text-decoration fallback:
ja: これらにはtext-decorationフォールバックが必要です。

source: Indicating Focus
ja: フォーカスを示す

source: One approach to inclusive interaction design is to look at interfaces from the perspective of human interface devices (HIDs): different devices which allow input from and/or output to a human user.
ja: インクルーシブなインタラクションデザインへのアプローチの1つに、ヒューマンインターフェイスデバイス（HID）の視点からインターフェイスを見るという方法があります。

source: A mouse is an HID.
ja: HIDは、人間（ユーザー）が入出力を行えるさまざまな機器で、マウスもその1つです。

source: So are keyboards, touch displays, refreshable braille displays and keyboards, joysticks16 and switches17.
ja: その他には、キーボード、タッチディスプレイ、点字ディスプレイおよびキーボード、ジョイスティック（脚注29）、スイッチ（脚注30）などがあります。

source: Designing inclusively is to support as many of these as possible and provide alternative content and interaction mechanisms where this isn’t possible.
ja: インクルーシブなデザインの目的は、これらをできるだけ広くサポートし、それが不可能な場合には、代替のコンテンツやインタラクションメカニズムを提供することです。

source: Making an element keyboard-accessible is quite straightforward:
ja: キーボードで要素にアクセスできるようにするのは、非常に簡単です。

source: •Make sure the element is focusable.
ja: • 要素をフォーカス可能にする。

source: •Make sure the focusable element is visible.
ja: • フォーカス可能な要素を可視にする。

source: •Make sure the focus state of the element is visible.
ja: • 要素のフォーカス状態を可視にする。

source: Links, like the <button> element addressed in the introduction, are implicitly focusable.
ja: 「はじめに」で触れた<button>要素などのリンクは、暗黙的にフォーカス可能です。
